//        1. Создайте класс Unary
//        2. Создайте переменную с положительным знаком
//        3. Измените знак на отрицательный используя унарный минус
//        4. Результат распечатайте в консоле

public class Unary {

    public static void main(String[] args) {
        int a = 4;
        int b = -a;
        System.out.println(b);
    }
}


