//ЗАДАНИЕ
//        1. Используйте цикл do-while
//        2. Инициализируйте переменную int i = 0;
//        3. Добавьте в тело инструкцию System.out.println("Я в теле DO");
//        4. Определите условие i < 3
//        5. Запустите код
//        6. Определите условие i < 0
//        7. Проанализируйте результат

public class LoopDoWhileTaskOne {

    public static void main(String[] args) {

        int i = 0;

        do {
            System.out.println("Я в теле DO");
            i++;
        } while (i < 3);

    }
}
